// 자바스크립트의 본연의 역할 = 넷프케이프사에서 브라우저에서 동작하기 위한 언어개발 (전 이름: Mocha)
// 브라우저에서 동적인 부분들을 핸들링할 수 있는 것이 자바스크립트이다

// DOM의 기본 상식
// DOM = Document Object Model의 약자
// 자바스크립트가 HTML문서를 해석하기 위해서 파싱한 결과물이다.
// Document(HTML파일)를 Javascript가 알아 먹을 수 있는 Object형태로 Modeling한것이다.

// 사용자 =  브라우저 = 클라이언트 같은 의미다. 
// 클라이언트가 서버에게 요청(request)를 송신
// 서버는 클라이언트에게 응답(response)을 반환 

// 브라우저가 HTML파일을 해석(parsing 파싱)


// DOM은 항상 브라우저환경에서 돌아간다.
// DOM이 브라우저에 내장되어 있기 때문에 우리는 HTML의 내용을 자바스크립트로
// 1) 접근 2) 제어 할수있다.
// 모든 DOM의 Node들은 속성과 메서드를 가지고 있다.  

// 메서드: 동사형태로 됨 
// 속성: 동사형태가 아님

// 